Produce a list of bookings on the day of 2012-09-14 which
will cost the member (or guest) more than $30. Remember that guests have
different costs to members (the listed costs are per half-hour 'slot'), and
the guest user's ID is always 0. Include in your output the name of the
facility, the name of the member formatted as a single column, and the cost.
Order by descending cost, and do not use any subqueries.

### Setup Connection Functions

In [1]:
import sqlite3
from sqlite3 import Error

 
def create_connection(db_file):
    """ create a database connection to the SQLite database
        specified by the db_file
    :param db_file: database file
    :return: Connection object or None
    """
    conn = None
    try:
        conn = sqlite3.connect(db_file)
        print(sqlite3.version)
    except Error as e:
        print(e)
 
    return conn

 
def select_all_tasks(conn,query):
    """
    Query all rows in the tasks table
    :param conn: the Connection object
    :return:
    """
    cur = conn.cursor()
    
#    query1 = """
#       SELECT *
#      FROM Bookings as b
#       INNER JOIN Members as m
#       Using (memid)
#       INNER JOIN Facilities as f
#       Using (facid)
#       WHERE (m.membercost > 30 OR m.guestcost > 30)
#       AND starttime like "2012-09-14%"
#    
#        """

#    query = """select * from bookings"""

    cur.execute(query)

    rows = cur.fetchall()
    
    
    
#    for row in rows:
#        print(row)

    return rows

def main():
    database = "sqlite_db_pythonsqlite.db"
 
    # create a database connection
    conn = create_connection(database)
    with conn: 
        print("2. Query all tasks")
        select_all_tasks(conn)
 
 
#if __name__ == '__main__':
#    main()

### Setup dataframes

In [2]:
import pandas as pd

##### Facilities

In [3]:
query = """PRAGMA table_info(facilities);"""
_ = select_all_tasks(create_connection("sqlite_db_pythonsqlite.db"),query)
columnlist = [record[1] for record in _]

query = """select * from facilities"""
_ = select_all_tasks(create_connection("sqlite_db_pythonsqlite.db"),query)
facilities = pd.DataFrame(_, columns=columnlist).set_index('facid')
facilities.head()

2.6.0
2.6.0

,name,membercost,guestcost,initialoutlay,monthlymaintenance
facid,,,,,
0,Tennis Court 1,5.0,25.0,10000,200
1,Tennis Court 2,5.0,25.0,8000,200
2,Badminton Court,0.0,15.5,4000,50
3,Table Tennis,0.0,5.0,320,10
4,Massage Room 1,9.9,80.0,4000,3000

##### Members

In [4]:
query = """PRAGMA table_info(members);"""
_ = select_all_tasks(create_connection("sqlite_db_pythonsqlite.db"),query)
columnlist = [record[1] for record in _]

query = """select * from members"""
_ = select_all_tasks(create_connection("sqlite_db_pythonsqlite.db"),query)
members = pd.DataFrame(_, columns=columnlist).set_index('memid')
members.head()

2.6.0
2.6.0

,surname,firstname,address,zipcode,telephone,recommendedby,joindate
memid,,,,,,,
0,GUEST,GUEST,GUEST,0,(000) 000-0000,,2012-07-01 00:00:00
1,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05
2,Smith,Tracy,"8 Bloomsbury Close, New York",4321,555-555-5555,,2012-07-02 12:08:23
3,Rownam,Tim,"23 Highway Way, Boston",23423,(844) 693-0723,,2012-07-03 09:32:15
4,Joplette,Janice,"20 Crossing Road, New York",234,(833) 942-4710,1,2012-07-03 10:25:05

##### Bookings

In [5]:
query = """PRAGMA table_info(bookings);"""
_ = select_all_tasks(create_connection("sqlite_db_pythonsqlite.db"),query)
columnlist = [record[1] for record in _]

query = """select * from bookings"""
_ = select_all_tasks(create_connection("sqlite_db_pythonsqlite.db"),query)
bookings = pd.DataFrame(_, columns=columnlist).set_index('bookid')
bookings.head()

2.6.0
2.6.0

        facid  memid            starttime  slots
bookid
0           3      1  2012-07-03 11:00:00      2
1           4      1  2012-07-03 08:00:00      2
2           6      0  2012-07-03 18:00:00      2
3           7      1  2012-07-03 19:00:00      2
4           8      1  2012-07-03 10:00:00      1

### Q1: Some of the facilities charge a fee to members, but some do not. Write a SQL query to produce a list of the names of the facilities that do.

In [6]:
facilities.head()

,name,membercost,guestcost,initialoutlay,monthlymaintenance
facid,,,,,
0,Tennis Court 1,5.0,25.0,10000,200
1,Tennis Court 2,5.0,25.0,8000,200
2,Badminton Court,0.0,15.5,4000,50
3,Table Tennis,0.0,5.0,320,10
4,Massage Room 1,9.9,80.0,4000,3000

In [7]:
query = """select * from facilities where membercost > 0"""
select_all_tasks(create_connection("sqlite_db_pythonsqlite.db"),query)

2.6.0

[(0, 'Tennis Court 1', 5, 25, 10000, 200),
 (1, 'Tennis Court 2', 5, 25, 8000, 200),
 (4, 'Massage Room 1', 9.9, 80, 4000, 3000),
 (5, 'Massage Room 2', 9.9, 80, 4000, 3000),
 (6, 'Squash Court', 3.5, 17.5, 5000, 80)]

### Q2: How many facilities do not charge a fee to members?

In [8]:
query = """select * from facilities where membercost = 0"""
select_all_tasks(create_connection("sqlite_db_pythonsqlite.db"),query)

2.6.0

[(2, 'Badminton Court', 0, 15.5, 4000, 50),
 (3, 'Table Tennis', 0, 5, 320, 10),
 (7, 'Snooker Table', 0, 5, 450, 15),
 (8, 'Pool Table', 0, 5, 400, 15)]

### Q3: Write an SQL query to show a list of facilities that charge a fee to members, where the fee is less than 20% of the facility's monthly maintenance cost. Return the facid, facility name, member cost, and monthly maintenance of the facilities in question.

In [9]:
query = """select facid,name,membercost,monthlymaintenance from facilities where membercost > 0 and membercost < .2*monthlymaintenance"""
select_all_tasks(create_connection("sqlite_db_pythonsqlite.db"),query)

2.6.0

[(0, 'Tennis Court 1', 5, 200),
 (1, 'Tennis Court 2', 5, 200),
 (4, 'Massage Room 1', 9.9, 3000),
 (5, 'Massage Room 2', 9.9, 3000),
 (6, 'Squash Court', 3.5, 80)]

### Q4: Write an SQL query to retrieve the details of facilities with ID 1 and 5. Try writing the query without using the OR operator.

In [10]:
query = """select * from facilities where facid in (1,5)"""
select_all_tasks(create_connection("sqlite_db_pythonsqlite.db"),query)

2.6.0

[(1, 'Tennis Court 2', 5, 25, 8000, 200),
 (5, 'Massage Room 2', 9.9, 80, 4000, 3000)]

### Q5: Produce a list of facilities, with each labelled as 'cheap' or 'expensive', depending on if their monthly maintenance cost is more than $100. Return the name and monthly maintenance of the facilities in question.

In [11]:
query = """select name, monthlymaintenance, case when monthlymaintenance > 100 then 'expensive' when monthlymaintenance < 100 then 'cheap' end relativeprice from facilities"""
select_all_tasks(create_connection("sqlite_db_pythonsqlite.db"),query)

2.6.0

[('Tennis Court 1', 200, 'expensive'),
 ('Tennis Court 2', 200, 'expensive'),
 ('Badminton Court', 50, 'cheap'),
 ('Table Tennis', 10, 'cheap'),
 ('Massage Room 1', 3000, 'expensive'),
 ('Massage Room 2', 3000, 'expensive'),
 ('Squash Court', 80, 'cheap'),
 ('Snooker Table', 15, 'cheap'),
 ('Pool Table', 15, 'cheap')]

### Q6: You'd like to get the first and last name of the last member(s) who signed up. Try not to use the LIMIT clause for your solution.

In [12]:
members.head()

,surname,firstname,address,zipcode,telephone,recommendedby,joindate
memid,,,,,,,
0,GUEST,GUEST,GUEST,0,(000) 000-0000,,2012-07-01 00:00:00
1,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05
2,Smith,Tracy,"8 Bloomsbury Close, New York",4321,555-555-5555,,2012-07-02 12:08:23
3,Rownam,Tim,"23 Highway Way, Boston",23423,(844) 693-0723,,2012-07-03 09:32:15
4,Joplette,Janice,"20 Crossing Road, New York",234,(833) 942-4710,1,2012-07-03 10:25:05

In [13]:
query = """select firstname,surname from members where joindate >= (select max(joindate) from members)"""
select_all_tasks(create_connection("sqlite_db_pythonsqlite.db"),query)

2.6.0

[('Darren', 'Smith')]

In [14]:
query = """select * from (select firstname,surname,row_number() over (order by joindate desc) recentjoin from members) where recentjoin <= 3"""
select_all_tasks(create_connection("sqlite_db_pythonsqlite.db"),query)

2.6.0

[('Darren', 'Smith', 1), ('Erica', 'Crumpet', 2), ('John', 'Hunt', 3)]

### Q7: Produce a list of all members who have used a tennis court. Include in your output the name of the court, and the name of the member formatted as a single column. Ensure no duplicate data, and order by the member name.

In [15]:
facilities.head(2)

,name,membercost,guestcost,initialoutlay,monthlymaintenance
facid,,,,,
0,Tennis Court 1,5.0,25.0,10000,200
1,Tennis Court 2,5.0,25.0,8000,200

In [16]:
members.head(2)

,surname,firstname,address,zipcode,telephone,recommendedby,joindate
memid,,,,,,,
0,GUEST,GUEST,GUEST,0,(000) 000-0000,,2012-07-01 00:00:00
1,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05

In [17]:
bookings.head(10)

        facid  memid            starttime  slots
bookid
0           3      1  2012-07-03 11:00:00      2
1           4      1  2012-07-03 08:00:00      2
2           6      0  2012-07-03 18:00:00      2
3           7      1  2012-07-03 19:00:00      2
4           8      1  2012-07-03 10:00:00      1
5           8      1  2012-07-03 15:00:00      1
6           0      2  2012-07-04 09:00:00      3
7           0      2  2012-07-04 15:00:00      3
8           4      3  2012-07-04 13:30:00      2
9           4      0  2012-07-04 15:00:00      2

In [18]:
query = """select distinct surname, firstname from members a left join bookings b on a.memid = b.memid left join facilities c on b.facid = c.facid where c.name like '%Tennis Court%' order by surname desc"""
select_all_tasks(create_connection("sqlite_db_pythonsqlite.db"),query)

2.6.0

[('Tracy', 'Burton'),
 ('Stibbons', 'Ponder'),
 ('Smith', 'Darren'),
 ('Smith', 'Tracy'),
 ('Smith', 'Jack'),
 ('Sarwin', 'Ramnaresh'),
 ('Rumney', 'Henrietta'),
 ('Rownam', 'Tim'),
 ('Purview', 'Millicent'),
 ('Pinker', 'David'),
 ('Owen', 'Charles'),
 ('Joplette', 'Janice'),
 ('Jones', 'David'),
 ('Jones', 'Douglas'),
 ('Hunt', 'John'),
 ('Genting', 'Matthew'),
 ('GUEST', 'GUEST'),
 ('Farrell', 'Jemima'),
 ('Farrell', 'David'),
 ('Dare', 'Nancy'),
 ('Crumpet', 'Erica'),
 ('Coplin', 'Joan'),
 ('Butters', 'Gerald'),
 ('Boothe', 'Tim'),
 ('Baker', 'Anne'),
 ('Baker', 'Timothy'),
 ('Bader', 'Florence')]

### Produce a list of bookings on the day of 2012-09-14 which will cost the member (or guest) more than $30. Remember that guests have different costs to members (the listed costs are per half-hour 'slot'), and the guest user's ID is always 0. Include in your output the name of the facility, the name of the member formatted as a single column, and the cost. Order by descending cost, and do not use any subqueries.

In [19]:
query = """select b.name, c.surname || ',' || c.firstname membername, case when a.memid = 0 then b.guestcost when a.memid != 0 then b.membercost end bookcost from bookings a left join facilities b on a.facid = b.facid left join members c on a.memid = c.memid where date(a.starttime) = '2012-09-14' and ( (a.memid=0 and b.guestcost>30) or (a.memid!=0 and b.membercost>30) ) order by case when a.memid = 0 then b.guestcost when a.memid != 0 then b.membercost end desc"""
select_all_tasks(create_connection("sqlite_db_pythonsqlite.db"),query)

2.6.0

[('Massage Room 1', 'GUEST,GUEST', 80),
 ('Massage Room 1', 'GUEST,GUEST', 80),
 ('Massage Room 1', 'GUEST,GUEST', 80),
 ('Massage Room 2', 'GUEST,GUEST', 80)]

### Q9: This time, produce the same result as in Q8, but using a subquery.

In [20]:
query = """select name, membername, bookcost from (select b.name, c.surname || ',' || c.firstname membername, case when a.memid = 0 then b.guestcost when a.memid != 0 then b.membercost end bookcost from bookings a left join facilities b on a.facid = b.facid left join members c on a.memid = c.memid where date(a.starttime) = '2012-09-14' and ( (a.memid=0 and b.guestcost>30) or (a.memid!=0 and b.membercost>30) ) ) order by bookcost"""
select_all_tasks(create_connection("sqlite_db_pythonsqlite.db"),query)

2.6.0

[('Massage Room 1', 'GUEST,GUEST', 80),
 ('Massage Room 1', 'GUEST,GUEST', 80),
 ('Massage Room 1', 'GUEST,GUEST', 80),
 ('Massage Room 2', 'GUEST,GUEST', 80)]

### Q10: Produce a list of facilities with a total revenue less than 1000. The output of facility name and total revenue, sorted by revenue. Remember that there's a different cost for guests and members!

In [21]:
query = """select name, sum( monthlybookingrevenue - ( initialoutlay + (monthlymaintenance*monthcount) ) ) totalrevenue from ( select b.name, strftime('%Y-%m',a.starttime) monthdate, max( b.initialoutlay ) initialoutlay, max( b.monthlymaintenance ) monthlymaintenance, sum( case when a.memid = 0 then b.guestcost*a.slots when a.memid!=0 then b.membercost*a.slots end ) monthlybookingrevenue, count(*) over (partition by b.name) monthcount from bookings a left join facilities b on a.facid = b.facid group by b.name, strftime('%Y-%m',a.starttime) ) group by name having totalrevenue < 1000 order by totalrevenue desc"""
select_all_tasks(create_connection("sqlite_db_pythonsqlite.db"),query)

2.6.0

[('Table Tennis', -870),
 ('Pool Table', -1065),
 ('Snooker Table', -1245),
 ('Squash Court', -2252.0),
 ('Badminton Court', -10543.5),
 ('Tennis Court 2', -11490),
 ('Tennis Court 1', -17940),
 ('Massage Room 2', -24545.399999999998)]

### Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order

In [22]:
members.head()

,surname,firstname,address,zipcode,telephone,recommendedby,joindate
memid,,,,,,,
0,GUEST,GUEST,GUEST,0,(000) 000-0000,,2012-07-01 00:00:00
1,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05
2,Smith,Tracy,"8 Bloomsbury Close, New York",4321,555-555-5555,,2012-07-02 12:08:23
3,Rownam,Tim,"23 Highway Way, Boston",23423,(844) 693-0723,,2012-07-03 09:32:15
4,Joplette,Janice,"20 Crossing Road, New York",234,(833) 942-4710,1,2012-07-03 10:25:05

In [23]:
query = """select a.surname || ',' || a.firstname membername, b.surname || ',' || b.firstname recommendation from members a left join members b on a.recommendedby = b.memid where a.recommendedby > 0"""
select_all_tasks(create_connection("sqlite_db_pythonsqlite.db"),query)

2.6.0

[('Joplette,Janice', 'Smith,Darren'),
 ('Butters,Gerald', 'Smith,Darren'),
 ('Dare,Nancy', 'Joplette,Janice'),
 ('Boothe,Tim', 'Rownam,Tim'),
 ('Stibbons,Ponder', 'Tracy,Burton'),
 ('Owen,Charles', 'Smith,Darren'),
 ('Jones,David', 'Joplette,Janice'),
 ('Baker,Anne', 'Stibbons,Ponder'),
 ('Smith,Jack', 'Smith,Darren'),
 ('Bader,Florence', 'Stibbons,Ponder'),
 ('Baker,Timothy', 'Farrell,Jemima'),
 ('Pinker,David', 'Farrell,Jemima'),
 ('Genting,Matthew', 'Butters,Gerald'),
 ('Mackenzie,Anna', 'Smith,Darren'),
 ('Coplin,Joan', 'Baker,Timothy'),
 ('Sarwin,Ramnaresh', 'Bader,Florence'),
 ('Jones,Douglas', 'Jones,David'),
 ('Rumney,Henrietta', 'Genting,Matthew'),
 ('Worthington-Smyth,Henry', 'Smith,Tracy'),
 ('Purview,Millicent', 'Smith,Tracy'),
 ('Hunt,John', 'Purview,Millicent'),
 ('Crumpet,Erica', 'Smith,Tracy')]

### Q12: Find the facilities with their usage by member, but not guests

In [24]:
query = """select a.name, c.surname || ',' || c.firstname membername from facilities a left join bookings b on a.facid = b.facid left join members c on b.memid = c.memid group by a.name, membername having c.memid !=0 order by a.name desc"""
select_all_tasks(create_connection("sqlite_db_pythonsqlite.db"),query)

2.6.0

[('Tennis Court 2', 'Bader,Florence'),
 ('Tennis Court 2', 'Baker,Anne'),
 ('Tennis Court 2', 'Baker,Timothy'),
 ('Tennis Court 2', 'Boothe,Tim'),
 ('Tennis Court 2', 'Butters,Gerald'),
 ('Tennis Court 2', 'Dare,Nancy'),
 ('Tennis Court 2', 'Farrell,David'),
 ('Tennis Court 2', 'Farrell,Jemima'),
 ('Tennis Court 2', 'Hunt,John'),
 ('Tennis Court 2', 'Jones,David'),
 ('Tennis Court 2', 'Joplette,Janice'),
 ('Tennis Court 2', 'Owen,Charles'),
 ('Tennis Court 2', 'Purview,Millicent'),
 ('Tennis Court 2', 'Rownam,Tim'),
 ('Tennis Court 2', 'Rumney,Henrietta'),
 ('Tennis Court 2', 'Sarwin,Ramnaresh'),
 ('Tennis Court 2', 'Smith,Darren'),
 ('Tennis Court 2', 'Smith,Jack'),
 ('Tennis Court 2', 'Smith,Tracy'),
 ('Tennis Court 2', 'Stibbons,Ponder'),
 ('Tennis Court 2', 'Tracy,Burton'),
 ('Tennis Court 1', 'Bader,Florence'),
 ('Tennis Court 1', 'Baker,Anne'),
 ('Tennis Court 1', 'Baker,Timothy'),
 ('Tennis Court 1', 'Boothe,Tim'),
 ('Tennis Court 1', 'Butters,Gerald'),
 ('Tennis Court 1', 'Coplin,Joan'),
 ('Tennis Court 1', 'Crumpet,Erica'),
 ('Tennis Court 1', 'Dare,Nancy'),
 ('Tennis Court 1', 'Farrell,David'),
 ('Tennis Court 1', 'Farrell,Jemima'),
 ('Tennis Court 1', 'Genting,Matthew'),
 ('Tennis Court 1', 'Hunt,John'),
 ('Tennis Court 1', 'Jones,David'),
 ('Tennis Court 1', 'Jones,Douglas'),
 ('Tennis Court 1', 'Joplette,Janice'),
 ('Tennis Court 1', 'Owen,Charles'),
 ('Tennis Court 1', 'Pinker,David'),
 ('Tennis Court 1', 'Rownam,Tim'),
 ('Tennis Court 1', 'Sarwin,Ramnaresh'),
 ('Tennis Court 1', 'Smith,Jack'),
 ('Tennis Court 1', 'Smith,Tracy'),
 ('Tennis Court 1', 'Stibbons,Ponder'),
 ('Tennis Court 1', 'Tracy,Burton'),
 ('Table Tennis', 'Bader,Florence'),
 ('Table Tennis', 'Baker,Anne'),
 ('Table Tennis', 'Baker,Timothy'),
 ('Table Tennis', 'Boothe,Tim'),
 ('Table Tennis', 'Butters,Gerald'),
 ('Table Tennis', 'Coplin,Joan'),
 ('Table Tennis', 'Crumpet,Erica'),
 ('Table Tennis', 'Dare,Nancy'),
 ('Table Tennis', 'Farrell,Jemima'),
 ('Table Tennis', 'Genting,Matthew'),
 ('Table Tennis', 'Hunt,John'),
 ('Table Tennis', 'Jones,David'),
 ('Table Tennis', 'Joplette,Janice'),
 ('Table Tennis', 'Mackenzie,Anna'),
 ('Table Tennis', 'Owen,Charles'),
 ('Table Tennis', 'Pinker,David'),
 ('Table Tennis', 'Purview,Millicent'),
 ('Table Tennis', 'Rownam,Tim'),
 ('Table Tennis', 'Sarwin,Ramnaresh'),
 ('Table Tennis', 'Smith,Darren'),
 ('Table Tennis', 'Smith,Jack'),
 ('Table Tennis', 'Smith,Tracy'),
 ('Table Tennis', 'Stibbons,Ponder'),
 ('Table Tennis', 'Tracy,Burton'),
 ('Table Tennis', 'Worthington-Smyth,Henry'),
 ('Squash Court', 'Bader,Florence'),
 ('Squash Court', 'Baker,Anne'),
 ('Squash Court', 'Baker,Timothy'),
 ('Squash Court', 'Boothe,Tim'),
 ('Squash Court', 'Butters,Gerald'),
 ('Squash Court', 'Coplin,Joan'),
 ('Squash Court', 'Farrell,David'),
 ('Squash Court', 'Farrell,Jemima'),
 ('Squash Court', 'Hunt,John'),
 ('Squash Court', 'Jones,David'),
 ('Squash Court', 'Jones,Douglas'),
 ('Squash Court', 'Joplette,Janice'),
 ('Squash Court', 'Mackenzie,Anna'),
 ('Squash Court', 'Owen,Charles'),
 ('Squash Court', 'Pinker,David'),
 ('Squash Court', 'Purview,Millicent'),
 ('Squash Court', 'Rumney,Henrietta'),
 ('Squash Court', 'Sarwin,Ramnaresh'),
 ('Squash Court', 'Smith,Darren'),
 ('Squash Court', 'Smith,Jack'),
 ('Squash Court', 'Smith,Tracy'),
 ('Squash Court', 'Stibbons,Ponder'),
 ('Squash Court', 'Tracy,Burton'),
 ('Squash Court', 'Tupperware,Hyacinth'),
 ('Snooker Table', 'Bader,Florence'),
 ('Snooker Table', 'Boothe,Tim'),
 ('Snooker Table', 'Butters,Gerald'),
 ('Snooker Table', 'Coplin,Joan'),
 ('Snooker Table', 'Dare,Nancy'),
 ('Snooker Table', 'Farrell,David'),
 ('Snooker Table', 'Farrell,Jemima'),
 ('Snooker Table', 'Genting,Matthew'),
 ('Snooker Table', 'Jones,David'),
 ('Snooker Table', 'Joplette,Janice'),
 ('Snooker Table', 'Mackenzie,Anna'),
 ('Snooker Table', 'Owen,Charles'),
 ('Snooker Table', 'Pinker,David'),
 ('Snooker Table', 'Purview,Millicent'),
 ('Snooker Table', 'Rumney,Henrietta'),
 ('Snooker Table', 'Sarwin,Ramnaresh'),
 ('Snooker Table', 'Smith,Darren'),
 ('Snooker Table', 'Smith,Jack'),
 ('Snooker Table', 'Smith,Tracy'),
 ('Snooker Table', 'Stibbons,Ponder'),
 ('Snooker Table', 'Tracy,Burton'),
 ('Snooker Table', 'Tupperware,Hyacinth'),
 ('Pool Table', 'Bader,Florence'),
 ('Pool Table', 'Baker,Anne'),
 ('Pool Table', 'Baker,Timothy'),
 ('Pool Table', 'Boothe,Tim'),
 ('Pool Table', 'Butters,Gerald'),
 ('Pool Table', 'Coplin,Joan'),
 ('Pool Table', 'Dare,Nancy'),
 ('Pool Table', 'Farrell,David'),
 ('Pool Table', 'Farrell,Jemima'),
 ('Pool Table', 'Genting,Matthew'),
 ('Pool Table', 'Jones,David'),
 ('Pool Table', 'Jones,Douglas'),
 ('Pool Table', 'Joplette,Janice'),
 ('Pool Table', 'Mackenzie,Anna'),
 ('Pool Table', 'Owen,Charles'),
 ('Pool Table', 'Pinker,David'),
 ('Pool Table', 'Purview,Millicent'),
 ('Pool Table', 'Rownam,Tim'),
 ('Pool Table', 'Rumney,Henrietta'),
 ('Pool Table', 'Sarwin,Ramnaresh'),
 ('Pool Table', 'Smith,Darren'),
 ('Pool Table', 'Smith,Jack'),
 ('Pool Table', 'Smith,Tracy'),
 ('Pool Table', 'Stibbons,Ponder'),
 ('Pool Table', 'Tracy,Burton'),
 ('Pool Table', 'Tupperware,Hyacinth'),
 ('Pool Table', 'Worthington-Smyth,Henry'),
 ('Massage Room 2', 'Bader,Florence'),
 ('Massage Room 2', 'Baker,Anne'),
 ('Massage Room 2', 'Butters,Gerald'),
 ('Massage Room 2', 'Coplin,Joan'),
 ('Massage Room 2', 'Dare,Nancy'),
 ('Massage Room 2', 'Genting,Matthew'),
 ('Massage Room 2', 'Jones,David'),
 ('Massage Room 2', 'Joplette,Janice'),
 ('Massage Room 2', 'Owen,Charles'),
 ('Massage Room 2', 'Rownam,Tim'),
 ('Massage Room 2', 'Sarwin,Ramnaresh'),
 ('Massage Room 2', 'Smith,Jack'),
 ('Massage Room 1', 'Baker,Anne'),
 ('Massage Room 1', 'Baker,Timothy'),
 ('Massage Room 1', 'Boothe,Tim'),
 ('Massage Room 1', 'Butters,Gerald'),
 ('Massage Room 1', 'Coplin,Joan'),
 ('Massage Room 1', 'Crumpet,Erica'),
 ('Massage Room 1', 'Dare,Nancy'),
 ('Massage Room 1', 'Farrell,Jemima'),
 ('Massage Room 1', 'Genting,Matthew'),
 ('Massage Room 1', 'Hunt,John'),
 ('Massage Room 1', 'Jones,David'),
 ('Massage Room 1', 'Joplette,Janice'),
 ('Massage Room 1', 'Mackenzie,Anna'),
 ('Massage Room 1', 'Owen,Charles'),
 ('Massage Room 1', 'Pinker,David'),
 ('Massage Room 1', 'Rownam,Tim'),
 ('Massage Room 1', 'Sarwin,Ramnaresh'),
 ('Massage Room 1', 'Smith,Darren'),
 ('Massage Room 1', 'Smith,Jack'),
 ('Massage Room 1', 'Smith,Tracy'),
 ('Massage Room 1', 'Stibbons,Ponder'),
 ('Massage Room 1', 'Tracy,Burton'),
 ('Massage Room 1', 'Tupperware,Hyacinth'),
 ('Massage Room 1', 'Worthington-Smyth,Henry'),
 ('Badminton Court', 'Bader,Florence'),
 ('Badminton Court', 'Baker,Anne'),
 ('Badminton Court', 'Baker,Timothy'),
 ('Badminton Court', 'Boothe,Tim'),
 ('Badminton Court', 'Butters,Gerald'),
 ('Badminton Court', 'Crumpet,Erica'),
 ('Badminton Court', 'Dare,Nancy'),
 ('Badminton Court', 'Farrell,Jemima'),
 ('Badminton Court', 'Hunt,John'),
 ('Badminton Court', 'Jones,David'),
 ('Badminton Court', 'Jones,Douglas'),
 ('Badminton Court', 'Mackenzie,Anna'),
 ('Badminton Court', 'Owen,Charles'),
 ('Badminton Court', 'Pinker,David'),
 ('Badminton Court', 'Purview,Millicent'),
 ('Badminton Court', 'Rownam,Tim'),
 ('Badminton Court', 'Sarwin,Ramnaresh'),
 ('Badminton Court', 'Smith,Darren'),
 ('Badminton Court', 'Smith,Jack'),
 ('Badminton Court', 'Smith,Tracy'),
 ('Badminton Court', 'Stibbons,Ponder'),
 ('Badminton Court', 'Tracy,Burton'),
 ('Badminton Court', 'Tupperware,Hyacinth'),
 ('Badminton Court', 'Worthington-Smyth,Henry')]

### Q13: Find the facilities usage by month, but not guests

In [25]:
query = """select distinct a.name, strftime('%Y-%m',b.starttime) monthdate, count(*) over (partition by a.name, strftime('%Y-%m',b.starttime)) usage from facilities a left join bookings b on a.facid = b.facid left join members c on b.memid = c.memid where c.memid != 0"""
select_all_tasks(create_connection("sqlite_db_pythonsqlite.db"),query)

2.6.0

[('Badminton Court', '2012-07', 51),
 ('Badminton Court', '2012-08', 132),
 ('Badminton Court', '2012-09', 161),
 ('Massage Room 1', '2012-07', 77),
 ('Massage Room 1', '2012-08', 153),
 ('Massage Room 1', '2012-09', 191),
 ('Massage Room 2', '2012-07', 4),
 ('Massage Room 2', '2012-08', 9),
 ('Massage Room 2', '2012-09', 14),
 ('Pool Table', '2012-07', 103),
 ('Pool Table', '2012-08', 272),
 ('Pool Table', '2012-09', 408),
 ('Snooker Table', '2012-07', 68),
 ('Snooker Table', '2012-08', 154),
 ('Snooker Table', '2012-09', 199),
 ('Squash Court', '2012-07', 23),
 ('Squash Court', '2012-08', 85),
 ('Squash Court', '2012-09', 87),
 ('Table Tennis', '2012-07', 48),
 ('Table Tennis', '2012-08', 143),
 ('Table Tennis', '2012-09', 194),
 ('Tennis Court 1', '2012-07', 65),
 ('Tennis Court 1', '2012-08', 111),
 ('Tennis Court 1', '2012-09', 132),
 ('Tennis Court 2', '2012-07', 41),
 ('Tennis Court 2', '2012-08', 109),
 ('Tennis Court 2', '2012-09', 126)]